---
kind: type
id: T:Autodesk.Revit.DB.Events.ProgressStage
source: html/641d9262-094b-53bc-3909-1b8566f15d3e.htm
---
# Autodesk.Revit.DB.Events.ProgressStage

The associated action of a ProgressChanged event

## Syntax (C#)
```csharp
public enum ProgressStage
```